In [6]:
import pandas as pd
import numpy as np

In [5]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
series = frame.iloc[0]

In [3]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [4]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [6]:
frame.iloc[0]

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [7]:
frame-series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [8]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
series2

b    0
e    1
f    2
dtype: int32

In [9]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [11]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [13]:
series3=frame["d"]
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [15]:
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [16]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)), #standard normal 표준 정규 분포
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah    2.457129 -2.090453 -0.841258
Ohio   -0.554622  0.152120  0.267738
Texas   0.250151 -0.933306 -0.326298
Oregon  0.688981 -0.479025 -2.371239

In [17]:
np.abs(frame) #절대값

               b         d         e
Utah    2.457129  2.090453  0.841258
Ohio    0.554622  0.152120  0.267738
Texas   0.250151  0.933306  0.326298
Oregon  0.688981  0.479025  2.371239

In [ ]:
"""
map, apply 함수 map을 자주 사용
map : 시리즈에 적용
apply : 시리즈, 데이터프레임에 적용

applymap : 데이터프레임의 행/열 단위로 적용
"""

In [19]:
a=[1.1,2.2,3.3]
list(map(int,a)) # a를 정수로 변환, 리스트로 묶어줘야함

[1, 2, 3]

In [4]:
a=[1.1,2.2,3.3]
list(map(int,a))

[1, 2, 3]

In [15]:
data=pd.DataFrame({
    'kor':[50,70,90,100],
    'eng':[80,90,100,100],
    'mat':[30,40,50,60]    
},index=['1','2','3','4'])

In [16]:
data

   kor  eng  mat
1   50   80   30
2   70   90   40
3   90  100   50
4  100  100   60

In [19]:
data.kor=data.kor.map(lambda x:x/100)
data

   kor  eng  mat
1  0.5   80   30
2  0.7   90   40
3  0.9  100   50
4  1.0  100   60

In [26]:
data['kor']=data['kor']/100

In [27]:
data

   kor  eng  mat
1  0.5   80   30
2  0.7   90   40
3  0.9  100   50
4  1.0  100   60

In [29]:
data['eng']=data['eng'].map(lambda x:x/100) ##############################

In [30]:
data

   kor  eng  mat
1  0.5  0.8   30
2  0.7  0.9   40
3  0.9  1.0   50
4  1.0  1.0   60

In [31]:
data['mat']=data['mat'].map(lambda x:x/100)

In [32]:
data

   kor  eng  mat
1  0.5  0.8  0.3
2  0.7  0.9  0.4
3  0.9  1.0  0.5
4  1.0  1.0  0.6

In [33]:
data=data.map(lambda x:x*100) #데이터프레임에는 map함수 사용할 수 없음 map함수는 열단위로 처리 series에서 가능

AttributeError: 'DataFrame' object has no attribute 'map'

In [34]:
data=data*100

In [35]:
data

     kor    eng   mat
1   50.0   80.0  30.0
2   70.0   90.0  40.0
3   90.0  100.0  50.0
4  100.0  100.0  60.0

In [36]:
def summation(a):
    return a+10

In [37]:
data['mat'].map(summation) #연산값만 나올뿐 저장 안됨

1    40.0
2    50.0
3    60.0
4    70.0
Name: mat, dtype: float64

In [38]:
data

     kor    eng   mat
1   50.0   80.0  30.0
2   70.0   90.0  40.0
3   90.0  100.0  50.0
4  100.0  100.0  60.0

In [39]:
data['mat']=data['mat'].map(summation) #저장하는 작업 해줘야 저장됨

In [40]:
data

     kor    eng   mat
1   50.0   80.0  40.0
2   70.0   90.0  50.0
3   90.0  100.0  60.0
4  100.0  100.0  70.0

In [41]:
data.apply(lambda x:x/100) #map함수는 데이터프레임에서 처리 불가능하나 apply함수는 가능

   kor  eng  mat
1  0.5  0.8  0.4
2  0.7  0.9  0.5
3  0.9  1.0  0.6
4  1.0  1.0  0.7

In [42]:
data['kor'].apply(lambda x:x/100) #apply 함수는 series에서도 가능

1    0.5
2    0.7
3    0.9
4    1.0
Name: kor, dtype: float64

In [ ]:
#map 사용하는 경우
#key값(인덱스)을 이용하여 series간 맵핑할때

In [44]:
s1=pd.Series(data=['r','b','y'],
            index=['가','나','다'])
s1

가    r
나    b
다    y
dtype: object

In [46]:
s2=pd.Series(data=[10,20,30],
            index=['r','b','y'])
s2

r    10
b    20
y    30
dtype: int64

In [47]:
s1.map(s2)

가    10
나    20
다    30
dtype: int64

In [49]:
data

     kor    eng   mat
1   50.0   80.0  40.0
2   70.0   90.0  50.0
3   90.0  100.0  60.0
4  100.0  100.0  70.0

In [50]:
data.applymap(lambda x:x/100)

   kor  eng  mat
1  0.5  0.8  0.4
2  0.7  0.9  0.5
3  0.9  1.0  0.6
4  1.0  1.0  0.7

In [51]:
data

     kor    eng   mat
1   50.0   80.0  40.0
2   70.0   90.0  50.0
3   90.0  100.0  60.0
4  100.0  100.0  70.0

In [58]:
#소수점 없애고 점 이라고 문자
data.applymap(lambda x:str(int(x))+"점")

    kor   eng  mat
1   50점   80점  40점
2   70점   90점  50점
3   90점  100점  60점
4  100점  100점  70점

In [61]:
def score(s):
    return str(int(s)) + '점'

In [62]:
data.applymap(score)

    kor   eng  mat
1   50점   80점  40점
2   70점   90점  50점
3   90점  100점  60점
4  100점  100점  70점

In [21]:
age=pd.Series([20,25,15,35,45])
age

0    20
1    25
2    15
3    35
4    45
dtype: int64

In [22]:
age.map(lambda x:str(x//10*10)+"대")

0    20대
1    20대
2    10대
3    30대
4    40대
dtype: object

In [88]:
age.map(lambda x:str(x)[0])

0    2
1    2
2    1
3    3
4    4
dtype: object

In [24]:
df =pd.DataFrame([[1,3,5],[4,5,6],[7,8,10]])
df

   0  1   2
0  1  3   5
1  4  5   6
2  7  8  10

In [101]:
for i in range(3):
    print(max(df.loc[i])-min(df.loc[i]))

4
2
3

In [25]:
df[0]

0    1
1    4
2    7
Name: 0, dtype: int64

In [100]:
for i in range(3):
    print(max(df[i])-min(df[i]))

6
5
5

In [ ]:
#axis=1 : 행기준 함수 적용
#axis=0(default) : 열기준 함수 적용

In [27]:
df =pd.DataFrame([[1,3,5],[4,5,6],[7,8,10]])
df

   0  1   2
0  1  3   5
1  4  5   6
2  7  8  10

In [28]:
df.max()

0     7
1     8
2    10
dtype: int64

In [104]:
df.min()

0    1
1    3
2    5
dtype: int64

In [105]:
df.max()-df.min()

0    6
1    5
2    5
dtype: int64

In [106]:
df.max(axis=1)

0     5
1     6
2    10
dtype: int64

In [107]:
df.min(axis=1)

0    1
1    4
2    7
dtype: int64

In [108]:
df.max(axis=1)-df.min(axis=1)

0    4
1    2
2    3
dtype: int64

In [109]:
def maxmin(d):
    return d.max()-d.min()

In [110]:
df.apply(maxmin) #default로 axis=0, 열 단위 적용

0    6
1    5
2    5
dtype: int64

In [111]:
df.apply(maxmin, axis=1) #행 단위 적용

0    4
1    2
2    3
dtype: int64

In [31]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

In [32]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [114]:
frame.apply(maxmin)

b    9.0
d    9.0
e    9.0
dtype: float64

In [115]:
frame.apply(maxmin, axis=1)

Utah      2.0
Ohio      2.0
Texas     2.0
Oregon    2.0
dtype: float64

In [33]:
def myfunc2(x):
    return pd.Series([x.min(), x.max()],
                    index=['min','max'])

In [34]:
frame.apply(myfunc2)

       b     d     e
min  0.0   1.0   2.0
max  9.0  10.0  11.0

In [119]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [122]:
f"{3.12345:.2f}" #소수점 두자리까지

'3.12'

In [128]:
frame.apply(lambda x:f"{x:.2f}") #apply는 열에 적용

TypeError: unsupported format string passed to Series.__format__

In [127]:
frame.applymap(lambda x:f"{x:.2f}") #데이터프레임 각각의 요소에 적용

           b      d      e
Utah    0.00   1.00   2.00
Ohio    3.00   4.00   5.00
Texas   6.00   7.00   8.00
Oregon  9.00  10.00  11.00

In [129]:
data=pd.DataFrame({
    'kor':["50점","70점","90점","100점"],
    'eng':["80점","90점","100점","100점"],
    'mat':["30점","40점","50점","60점"]    
},index=['1','2','3','4'])

In [130]:
data

    kor   eng  mat
1   50점   80점  30점
2   70점   90점  40점
3   90점  100점  50점
4  100점  100점  60점

In [136]:
data.applymap(lambda x: x[:-1]) #각각의 데이터에 적용

   kor  eng mat
1   50   80  30
2   70   90  40
3   90  100  50
4  100  100  60

In [137]:
data.apply(lambda x: x[:-1]) #시리즈 단위로 적용, x에는 시리즈가 전달

   kor   eng  mat
1  50점   80점  30점
2  70점   90점  40점
3  90점  100점  50점

In [140]:
df=pd.read_csv("titanic/train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [147]:
df['Name'].apply(lambda x:x[:3])

0      Bra
1      Cum
2      Hei
3      Fut
4      All
      ...
886    Mon
887    Gra
888    Joh
889    Beh
890    Doo
Name: Name, Length: 891, dtype: object

In [148]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])
obj

d    0
a    1
b    2
c    3
dtype: int32

In [151]:
obj.sort_index() #index 정렬할 때 사용

a    1
b    2
c    3
d    0
dtype: int32

In [152]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [153]:
frame.sort_index() #axis=0 생략으로 행 인덱스 정렬

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [154]:
frame.sort_index(axis=1) #열 인덱스 기준으로 정렬

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [156]:
frame.sort_index(axis='columns') #열 인덱스 정렬

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [158]:
frame.sort_index(axis=1, ascending=False) #내림차순 정렬

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [159]:
obj

d    0
a    1
b    2
c    3
dtype: int32

In [160]:
obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int32

In [161]:
obj.sort_values(ascending=False)

c    3
b    2
a    1
d    0
dtype: int32

In [162]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [163]:
obj.sort_values(na_position="last")

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [164]:
obj.sort_values(na_position="first") #NaN의 위치를 맨 앞으로 설정

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [165]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [167]:
frame.sort_values(by="a") #a열을 기준으로 정렬

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [168]:
frame.sort_values(by="b") #b열을 기준으로 정렬

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [169]:
frame.sort_values("a")

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [170]:
frame.sort_values(["a","b"]) #a열 기준으로 정렬하고 a열 값이 중복되어 b열 기준으로 정렬

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [171]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [172]:
obj.rank(method="first") #동일한 숫자일때 먼저 나온게 높은 랭크

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [173]:
obj.rank(method="first", ascending=False) #r값이 클수록 높은 랭크

0    1.0
1    7.0
2    2.0
3    3.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [174]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                      "c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [175]:
frame.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [176]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [178]:
obj.index.is_unique #obj의 index 값이 유일한 숫자인가

False

In [179]:
obj['a']

a    0
a    1
dtype: int32

In [180]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])
df

          0         1         2
a -1.616414  0.405725  0.396641
a  0.446683 -0.530716 -0.269517
b  0.577627 -0.972416  0.822619
b -0.662724 -0.090291 -0.162403
c -0.936835 -0.692905  0.441003

In [181]:
df.loc['b'] #b라는 데이터를 가지고 있는 행이 두개라 데이터프레임 형식으로 출력

          0         1         2
b  0.577627 -0.972416  0.822619
b -0.662724 -0.090291 -0.162403

In [182]:
df.loc['c'] #c라는 데이터를 가지고 있는 행이 하나라 시리즈 형식으로 출력

0   -0.936835
1   -0.692905
2    0.441003
Name: c, dtype: float64

In [183]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [184]:
df.sum() #axis=0 생략 열 기준 합계

one    9.25
two   -5.80
dtype: float64

In [185]:
df.sum(axis=0)

one    9.25
two   -5.80
dtype: float64

In [186]:
df.sum(axis="index")

one    9.25
two   -5.80
dtype: float64

In [187]:
df.sum(axis=1) # 행 기준 합계

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [188]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [189]:
df.sum(axis=1, skipna=True) #NaN를 생략하는게 default

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [190]:
df.sum(axis=1, skipna=False) #NaN을 생략하지 않고 연산하여 결과값이 NaN

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [191]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [192]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [193]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [194]:
df.idxmax() #최대값의 index를 물어보는 함수

one    b
two    d
dtype: object

In [195]:
df.cumsum() #누적합

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [196]:
df.describe() #기술통계, 숫자일때 나오는 항목

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [197]:
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj.describe() #describe 함수 문자일 경우 나오는 항목

count     16
unique     3
top        a
freq       8
dtype: object

In [198]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [199]:
price=pd.read_pickle("yahoo_price.pkl")

In [200]:
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [204]:
returns=price.pct_change() #수익률
returns
#(25.892466-25.884104)/25.892466

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [201]:
volume=pd.read_pickle("yahoo_volume.pkl")

In [202]:
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [205]:
returns['MSFT'].corr(returns['IBM']) #상관계수, 가장 상관관계가 높음

0.4997636114415114

In [206]:
returns['MSFT'].corr(returns['AAPL'])

0.38969458628057846

In [207]:
returns['MSFT'].corr(returns['GOOG'])

0.46591879490796656

In [208]:
returns['MSFT'].cov(returns['IBM']) #공분산

8.870655479703546e-05

In [209]:
returns.corrwith(returns['IBM']) #IBM과 다른 기업들 간에 상관계수

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [210]:
returns.corrwith(returns['MSFT'])

AAPL    0.389695
GOOG    0.465919
IBM     0.499764
MSFT    1.000000
dtype: float64

In [211]:
pip install -U finance-datareader
#한국, 미국 주가, 지수, 환율, 암호화폐 등 정보 제공 api

Collecting finance-datareader
  Downloading finance_datareader-0.9.50-py3-none-any.whl (19 kB)
Requirement already satisfied: pandas>=0.19.2 in c:\users\user\anaconda3\lib\site-packages (from finance-datareader) (1.5.3)
Requirement already satisfied: requests>=2.3.0 in c:\users\user\anaconda3\lib\site-packages (from finance-datareader) (2.31.0)
Requirement already satisfied: requests-file in c:\users\user\anaconda3\lib\site-packages (from finance-datareader) (1.5.1)
Requirement already satisfied: lxml in c:\users\user\anaconda3\lib\site-packages (from finance-datareader) (4.9.2)
Requirement already satisfied: tqdm in c:\users\user\anaconda3\lib\site-packages (from finance-datareader) (4.65.0)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\user\anaconda3\lib\site-packages (from pandas>=0.19.2->finance-datareader) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\anaconda3\lib\site-packages (from pandas>=0.19.2->finance-datareader) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\user\anaconda3\lib\site-packages (from pandas>=0.19.2->finance-datareader) (1.24.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\user\anaconda3\lib\site-packages (from requests>=2.3.0->finance-datareader) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\users\user\anaconda3\lib\site-packages (from requests>=2.3.0->finance-datareader) (3.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\user\anaconda3\lib\site-packages (from requests>=2.3.0->finance-datareader) (1.26.16)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\user\anaconda3\lib\site-packages (from requests>=2.3.0->finance-datareader) (2023.7.22)
Requirement already satisfied: six in c:\users\user\anaconda3\lib\site-packages (from requests-file->finance-datareader) (1.16.0)
Requirement already satisfied: colorama in c:\users\user\anaconda3\lib\site-packages (from tqdm->finance-datareader) (0.4.6)
Installing collected packages: finance-datareader
Successfully installed finance-datareader-0.9.50
Note: you may need to restart the kernel to use updated packages.

In [212]:
import FinanceDataReader as fdr

In [214]:
fdr.StockListing??

In [215]:
df_krx=fdr.StockListing('KRX')

In [216]:
df_krx

,Code,ISU_CD,Name,Market,Dept,Close,ChangeCode,Changes,ChagesRatio,Open,High,Low,Volume,Amount,Marcap,Stocks,MarketId
0,005930,KR7005930003,삼성전자,KOSPI,,70800,3,0,0.00,70800,71000,70400,9815200,693166686800,422660604540000,5969782550,STK
1,373220,KR7373220003,LG에너지솔루션,KOSPI,,501000,2,-7000,-1.38,513000,516000,499500,253259,127469453000,117234000000000,234000000,STK
2,000660,KR7000660001,SK하이닉스,KOSPI,,116900,1,1000,0.86,115400,117500,113900,2415369,279474627100,85103476468500,728002365,STK
3,207940,KR7207940008,삼성바이오로직스,KOSPI,,724000,2,-10000,-1.36,738000,738000,721000,29910,21758920000,51529976000000,71174000,STK
4,005935,KR7005931001,삼성전자우,KOSPI,,57100,1,300,0.53,57500,57500,56800,710037,40552417100,46986830570000,822886700,STK
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2747,245450,KR7245450002,씨앤에스링크,KONEX,일반기업부,1650,2,-48,-2.83,1699,1699,1579,849,1341062,2606934000,1579960,KNX
2748,288490,KR7288490006,나라소프트,KONEX,일반기업부,54,2,-2,-3.57,56,56,51,75996,4057847,2336418270,43267005,KNX
2749,308700,KR7308700004,테크엔,KONEX,일반기업부,339,1,40,13.38,256,342,256,746,191314,1356000000,4000000,KNX
2750,322190,KR7322190000,베른,KONEX,일반기업부,122,2,-9,-6.87,131,131,112,11801,1325343,1088874034,8925197,KNX
2751,242350,KR7242350007,피엔아이컴퍼니,KONEX,일반기업부,54,2,-29,-34.94,81,81,52,513535,31389413,257932080,4776520,KNX

In [217]:
df_spx=fdr.StockListing('S&P500')

In [218]:
df_spx

,Symbol,Name,Sector,Industry
0,MMM,3M,Industrials,Industrial Conglomerates
1,AOS,A. O. Smith,Industrials,Building Products
2,ABT,Abbott,Health Care,Health Care Equipment
3,ABBV,AbbVie,Health Care,Pharmaceuticals
4,ACN,Accenture,Information Technology,IT Consulting & Other Services
...,...,...,...,...
498,YUM,Yum! Brands,Consumer Discretionary,Restaurants
499,ZBRA,Zebra Technologies,Information Technology,Electronic Equipment & Instruments
500,ZBH,Zimmer Biomet,Health Care,Health Care Equipment
501,ZION,Zions Bancorporation,Financials,Regional Banks
502,ZTS,Zoetis,Health Care,Pharmaceuticals

In [219]:
df_krx

,Code,ISU_CD,Name,Market,Dept,Close,ChangeCode,Changes,ChagesRatio,Open,High,Low,Volume,Amount,Marcap,Stocks,MarketId
0,005930,KR7005930003,삼성전자,KOSPI,,70800,3,0,0.00,70800,71000,70400,9815200,693166686800,422660604540000,5969782550,STK
1,373220,KR7373220003,LG에너지솔루션,KOSPI,,501000,2,-7000,-1.38,513000,516000,499500,253259,127469453000,117234000000000,234000000,STK
2,000660,KR7000660001,SK하이닉스,KOSPI,,116900,1,1000,0.86,115400,117500,113900,2415369,279474627100,85103476468500,728002365,STK
3,207940,KR7207940008,삼성바이오로직스,KOSPI,,724000,2,-10000,-1.36,738000,738000,721000,29910,21758920000,51529976000000,71174000,STK
4,005935,KR7005931001,삼성전자우,KOSPI,,57100,1,300,0.53,57500,57500,56800,710037,40552417100,46986830570000,822886700,STK
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2747,245450,KR7245450002,씨앤에스링크,KONEX,일반기업부,1650,2,-48,-2.83,1699,1699,1579,849,1341062,2606934000,1579960,KNX
2748,288490,KR7288490006,나라소프트,KONEX,일반기업부,54,2,-2,-3.57,56,56,51,75996,4057847,2336418270,43267005,KNX
2749,308700,KR7308700004,테크엔,KONEX,일반기업부,339,1,40,13.38,256,342,256,746,191314,1356000000,4000000,KNX
2750,322190,KR7322190000,베른,KONEX,일반기업부,122,2,-9,-6.87,131,131,112,11801,1325343,1088874034,8925197,KNX
2751,242350,KR7242350007,피엔아이컴퍼니,KONEX,일반기업부,54,2,-29,-34.94,81,81,52,513535,31389413,257932080,4776520,KNX

In [221]:
fdr.DataReader("005930", "2023")

             Open   High    Low  Close    Volume    Change
Date
2023-01-02  55500  56100  55200  55500  10031448  0.003617
2023-01-03  55400  56000  54500  55400  13547030 -0.001802
2023-01-04  55700  58000  55600  57800  20188071  0.043321
2023-01-05  58200  58800  57600  58200  15682826  0.006920
2023-01-06  58300  59400  57900  59000  17334989  0.013746
...           ...    ...    ...    ...       ...       ...
2023-09-06  70700  70800  69700  70000  11414620 -0.009901
2023-09-07  70000  70600  69600  70400  13741241  0.005714
2023-09-08  70200  70300  69600  70300  10688118 -0.001420
2023-09-11  70400  70800  70000  70800  11785462  0.007112
2023-09-12  70800  71000  70400  70600  10300631 -0.002825

[174 rows x 6 columns]

In [222]:
fdr.DataReader("005930", "2015-01-01", '2023-09-12')

             Open   High    Low  Close    Volume    Change
Date
2015-01-02  26799  26799  26540  26600    175499  0.002261
2015-01-05  26720  26720  26260  26660    202790  0.002256
2015-01-06  26300  26340  25760  25900    304710 -0.028507
2015-01-07  25880  26220  25640  26140    286455  0.009266
2015-01-08  26780  26780  26199  26280    289552  0.005356
...           ...    ...    ...    ...       ...       ...
2023-09-06  70700  70800  69700  70000  11414620 -0.009901
2023-09-07  70000  70600  69600  70400  13741241  0.005714
2023-09-08  70200  70300  69600  70300  10688118 -0.001420
2023-09-11  70400  70800  70000  70800  11785462  0.007112
2023-09-12  70800  71000  70400  70400  10473452 -0.005650

[2143 rows x 6 columns]

In [223]:
fdr.DataReader("AAPL", "2023")

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2023-01-03,130.279999,130.899994,124.169998,125.070000,124.538658,112117500
2023-01-04,126.889999,128.660004,125.080002,126.360001,125.823189,89113600
2023-01-05,127.129997,127.769997,124.760002,125.019997,124.488876,80962700
2023-01-06,126.010002,130.289993,124.889999,129.619995,129.069336,87754700
2023-01-09,130.470001,133.410004,129.889999,130.149994,129.597076,70790800
...,...,...,...,...,...,...
2023-09-05,188.279999,189.979996,187.610001,189.699997,189.699997,45280000
2023-09-06,188.399994,188.850006,181.470001,182.910004,182.910004,81755800
2023-09-07,175.179993,178.210007,173.539993,177.559998,177.559998,112488800
2023-09-08,178.350006,180.240005,177.789993,178.179993,178.179993,65551300
2023-09-11,180.070007,180.300003,177.339996,179.360001,179.360001,58863800

In [224]:
fdr.DataReader("KS11", "2015") #코스피 지수

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2015-01-02,1914.239990,1929.150024,1909.670044,1926.439941,1926.439941,258800.0
2015-01-05,1921.959961,1921.959961,1903.369995,1915.750000,1915.750000,313400.0
2015-01-06,1895.479980,1900.020020,1877.380005,1882.449951,1882.449951,303700.0
2015-01-07,1878.900024,1887.599976,1876.270020,1883.829956,1883.829956,280500.0
2015-01-08,1895.849976,1907.229980,1891.770020,1904.650024,1904.650024,262200.0
...,...,...,...,...,...,...
2023-09-06,2577.409912,2585.979980,2560.090088,2563.340088,2563.340088,421500.0
2023-09-07,2554.870117,2562.419922,2539.239990,2548.260010,2548.260010,376600.0
2023-09-08,2546.070068,2550.959961,2530.050049,2547.679932,2547.679932,395800.0
2023-09-11,2549.879883,2556.889893,2540.439941,2556.879883,2556.879883,410300.0
2023-09-12,2566.419922,2568.550049,2539.169922,2541.459961,2541.459961,310802.0

In [225]:
fdr.DataReader("USD/KRW", "1990")

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2003-12-01,1197.300049,1203.500000,1195.000000,1198.400024,1198.400024,0.0
2003-12-02,1198.099976,1198.500000,1186.199951,1195.000000,1195.000000,0.0
2003-12-03,1195.000000,1198.400024,1192.500000,1192.500000,1192.500000,0.0
2003-12-04,1192.599976,1197.900024,1174.800049,1190.099976,1190.099976,0.0
2003-12-05,1189.400024,1193.800049,1178.599976,1184.699951,1184.699951,0.0
...,...,...,...,...,...,...
2023-09-06,1331.729980,1337.560059,1328.189941,1331.729980,1331.729980,0.0
2023-09-07,1333.459961,1338.300049,1330.250000,1333.459961,1333.459961,0.0
2023-09-08,1334.020020,1335.530029,1331.260010,1334.020020,1334.020020,0.0
2023-09-11,1335.319946,1335.319946,1326.030029,1335.319946,1335.319946,0.0
2023-09-12,1323.920044,1328.020020,1322.619995,1326.910034,1326.910034,0.0

In [226]:
fdr.DataReader("BTC/KRW", "2016")

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2016-01-01,5.060929e+05,5.125672e+05,5.022874e+05,5.101036e+05,5.101036e+05,42607754105
2016-01-02,5.104418e+05,5.121330e+05,5.072097e+05,5.090512e+05,5.090512e+05,35346951870
2016-01-03,5.092157e+05,5.094095e+05,4.989786e+05,5.051554e+05,5.051554e+05,46559806550
2016-01-04,5.052142e+05,5.172751e+05,5.059330e+05,5.146464e+05,5.146464e+05,45723198025
2016-01-05,5.146202e+05,5.148096e+05,5.100812e+05,5.139287e+05,5.139287e+05,41073608576
...,...,...,...,...,...,...
2023-09-08,3.436035e+07,3.520864e+07,3.427928e+07,3.503118e+07,3.503118e+07,14803111745051
2023-09-09,3.503788e+07,3.519568e+07,3.425744e+07,3.461798e+07,3.461798e+07,14455341530358
2023-09-10,3.461768e+07,3.463980e+07,3.449082e+07,3.460465e+07,3.460465e+07,7324734888104
2023-09-11,3.460403e+07,3.471240e+07,3.426334e+07,3.452022e+07,3.452022e+07,10556360169923
2023-09-12,3.332326e+07,3.434798e+07,3.334525e+07,3.421360e+07,3.421360e+07,23375667789824

In [227]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [228]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [229]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [230]:
obj.value_counts() #중요

c    3
a    3
b    2
d    1
dtype: int64

In [233]:
pd.value_counts(obj.to_numpy(), sort=True)

c    3
a    3
b    2
d    1
dtype: int64

In [234]:
pd.value_counts(obj.to_numpy(), sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [235]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [238]:
obj.isin(['f']) #f가 안에 있는지 확인 함수

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [239]:
obj.isin(['f', 'b'])

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7    False
8    False
dtype: bool

In [240]:
obj[obj.isin(['f', 'b'])]

5    b
6    b
dtype: object

In [241]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [243]:
data['Qu1'].value_counts()

3    2
4    2
1    1
Name: Qu1, dtype: int64

In [244]:
data['Qu1'].value_counts().sort_index() #index를 기준으로 출력

1    1
3    2
4    2
Name: Qu1, dtype: int64

In [245]:
import numpy as np

In [246]:
data=[1,2,3]

In [247]:
np.array(data) #list를 array로 변환

array([1, 2, 3])

In [248]:
np.array(data).shape

(3,)

In [252]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df

     종목코드    종목명   현재가   등락률
0  037730     3R  1510  7.36
1  036360  3SOFT  1790  1.65
2  005760   ACTS  1185  1.28

In [259]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True) #종목코드를 인덱스로 지정

In [250]:
data

[['037730', '3R', 1510, 7.36],
 ['036360', '3SOFT', 1790, 1.65],
 ['005760', 'ACTS', 1185, 1.28]]

In [260]:
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [253]:
df["현재가"] #[]하나면 시리즈 구조

0    1510
1    1790
2    1185
Name: 현재가, dtype: int64

In [254]:
df[["현재가"]] #[]두개면 데이터프레임 구조

    현재가
0  1510
1  1790
2  1185

In [261]:
df.loc['037730']

종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object

In [262]:
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [265]:
df.loc[['037730', '005760']]

         종목명   현재가   등락률
종목코드
037730    3R  1510  7.36
005760  ACTS  1185  1.28

In [266]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)
df.set_index('종목코드', inplace=True)

In [267]:
data

[['037730', '3R', 1510, 7.36],
 ['036360', '3SOFT', 1790, 1.65],
 ['005760', 'ACTS', 1185, 1.28]]

In [268]:
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [ ]:
"""
위 데이터프레임에서 iloc 속성을 사용하여 첫번째, 두번째 행을 슬라이싱하세요.
위 데이터프레임에서 loc 속성을 사용하여 첫번째, 두번째 행을 슬라이싱하세요.
위 데이터프레임에서 iloc 속성을 사용하여 첫 번째 컬럼을 인덱싱하세요.
위 데이터프레임에서 loc 속성을 사용하여 첫 번째 컬럼을 인덱싱하세요.
위 데이터프레임에서 loc 속성을 사용하여 '037730' 종목의 '종목명', '현재가' 컬럼을 선택하세요.
위 데이터프레임에서 iloc 속성을 사용하여 '037730' 종목의 '종목명', '현재가' 컬럼을 선택하세요.
"""

In [272]:
df.iloc[[0, 1]]

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [273]:
df.loc[['037730', '005760']]

         종목명   현재가   등락률
종목코드
037730    3R  1510  7.36
005760  ACTS  1185  1.28

In [287]:
df.iloc[:,0]

종목코드
037730       3R
036360    3SOFT
005760     ACTS
Name: 종목명, dtype: object

In [288]:
df.loc[:,'종목명']

종목코드
037730       3R
036360    3SOFT
005760     ACTS
Name: 종목명, dtype: object

In [281]:
df.loc['037730'][:2]

종목명      3R
현재가    1510
Name: 037730, dtype: object

In [282]:
df.iloc[0][:2]

종목명      3R
현재가    1510
Name: 037730, dtype: object